using EntangleabilityOfCones
using Test
using Symbolics

@testset "EntangleabilityOfCones.jl" begin
    # @variables α₁ α₂ α₃ α₄ β₁ β₂ β₃ β₄ 
    # α = [α₁, α₂, α₃, α₄]
    # β = [β₁, β₂, β₃, β₄]
    @variables α[1:4] β[1:4]

    res = (-β[2] - β[3])*(α[2] + α[3]) + (-β[1] - β[4])*(α[1] + α[4]) + (α[2] + α[3])*(β[1] + β[4]) + (α[1] + α[4])*(β[2] + β[3]) + (α[2] + α[3])*β[1]*β[2]*β[3] + (α[2] + α[3])*β[2]*β[3]*β[4] + (β[1] + β[4] - β[2] - β[3])*α[1]*α[2]*α[4] + (α[1] + α[4])*β[1]*β[2]*β[4] + (α[1] + α[4])*β[1]*β[3]*β[4] + (β[2] + β[3] - β[1] - β[4])*α[1]*α[2]*α[3] + (β[2] + β[3] - β[1] - β[4])*α[2]*α[3]*α[4] + (β[1] + β[4] - β[2] - β[3])*α[1]*α[3]*α[4] + α[1]*α[2]*α[3]*β[1]*β[2]*β[4] + α[1]*α[2]*α[3]*β[1]*β[3]*β[4] + α[1]*α[2]*α[4]*β[1]*β[2]*β[3] + α[2]*α[3]*α[4]*β[1]*β[3]*β[4] + α[1]*α[2]*α[4]*β[2]*β[3]*β[4] + α[1]*α[3]*α[4]*β[1]*β[2]*β[3] + α[1]*α[3]*α[4]*β[2]*β[3]*β[4] + α[2]*α[3]*α[4]*β[1]*β[2]*β[4] - α[1]*β[1]*β[2]*β[3] - α[4]*β[1]*β[2]*β[3] - α[2]*β[1]*β[2]*β[4] - α[2]*β[1]*β[3]*β[4] - α[3]*β[1]*β[2]*β[4] - α[3]*β[1]*β[3]*β[4] - α[1]*β[2]*β[3]*β[4] - α[4]*β[2]*β[3]*β[4] - α[1]*α[2]*α[3]*β[1]*β[2]*β[3] - α[1]*α[2]*α[4]*β[1]*β[2]*β[4] - α[1]*α[2]*α[4]*β[1]*β[3]*β[4] - α[1]*α[3]*α[4]*β[1]*β[2]*β[4] - α[1]*α[2]*α[3]*β[2]*β[3]*β[4] - α[1]*α[3]*α[4]*β[1]*β[3]*β[4] - α[2]*α[3]*α[4]*β[1]*β[2]*β[3] - α[2]*α[3]*α[4]*β[2]*β[3]*β[4]

    @test (linear_form(α, β)-res)|>expand|>simplify ≈ 0
    @test (rhs(α, β)-res)|>expand|>simplify ≈ 0
    @test (linear_form(α, β)-rhs(α,β))|>expand|>simplify  ≈ 0

end
